Tekla Open API Reference for Tekla Structures 2025
ArcAttributes Constructor
Overload List
Name | Description
Arc.ArcAttributes()
 Creates a new default arc attributes instance that loads standard attributes.
Arc.ArcAttributes(String)
 Creates a new arc attributes instance that loads the specified attributes.
Top
See Also
Reference
Arc.ArcAttributes Class
Tekla.Structures.Drawing Namespace